app/Controllers/Auth.php

    public function login(){
        $data = $this->request->getJSON(true);
        if(!isset($data["request"])) return false;
        $data = $data["request"];
        $KullanicilarModel = new KullanicilarModel();
        $Control = $KullanicilarModel
            ->where("kullanici_adi",$data["kullanici_adi"])
            ->where("sifre",sha1("KLdAdsSW".$data["sifre"]."1AdsW85!x"))
            ->first();
---
SELECT *
FROM `kullanicilar`
WHERE `kullanici_adi` = 'fatihsen7'
AND `sifre` = '2ed0184d7fb2c7c1c941d751158d74744c5a4565'
 LIMIT 1

    public function Refresh(){
        $Request = $this->request->getJSON(true);
        $RefreshToken = $Request["token"];
        $TokenControl = $this->TokenControl($RefreshToken,"Refresh");
        if($TokenControl["status"]){
            $getTokenData = $this->TokenData();
            $KullanicilarModel = new KullanicilarModel();
            $Control = $KullanicilarModel->where('id',$getTokenData['id'])->first();
---
SELECT *
FROM `kullanicilar`
WHERE `id` = '13'
 LIMIT 1