app/Controllers/Dosyalar.php

SELECT `evrak_tipleri`.`isim` as `evrak`, `personal`.`isim` as `personel_isim`, `personal`.`soyisim` as `personel_soyisim`, `dosyalar`.*
FROM `dosyalar`
LEFT OUTER JOIN `evrak_tipleri` ON `evrak_tipleri`.`id` = `dosyalar`.`evrak_tip_id`
LEFT OUTER JOIN `personal` ON `personal`.`personel_no` = `dosyalar`.`personel_no`
WHERE `dosyalar`.`status` = 1
AND `dosyalar`.`personel_no` = '312312'
---
    public function show($id = null)
    {
        $data = $this->model
            ->select('evrak_tipleri.isim as evrak,
            personal.isim as personel_isim,
            personal.soyisim as personel_soyisim,
            dosyalar.*')
            ->join('evrak_tipleri', 'evrak_tipleri.id = dosyalar.evrak_tip_id', 'left outer')
            ->join('personal', 'personal.personel_no = dosyalar.personel_no', 'left outer')
            ->where('dosyalar.status',1)->where('dosyalar.personel_no', $id)->findAll();