app/Controllers/Download.php

    public function Single($id){
        $db = new DosyalarModel();

        $veri = $db->find($id);
---
SELECT *
FROM `dosyalar`
WHERE `dosyalar`.`id` = '21'